# Матрица вероятностей перехода между состояниями по цветам
P_look = [
    [0.6, 0.2, 0.2],
    [0.2, 0.6, 0.2],
    [0.2, 0.2, 0.6],
]


P_break = 0.15
P_rel_n = {0.0, 0.07, 0.14, 0.41, 0.61} # Все возможные значения p_click / p_buy_click


import numpy as np

# матрица вероятностей клика для каждого элемента выдачи
P_click = np.array([
    [0.07, 0.41],
    [0.0, 0.14],
    [0.14, 0.61],
    [0.07, 0.41],
    [0.0, 0.14],
    [0.61, 0.0],
    [0.14, 0.07],
    [0.14, 0.41],
    [0.07, 0.0],
    [0.41, 0.14],
    [0.07, 0.41],
    [0.0, 0.14],
    [0.14, 0.61],
    [0.07, 0.41],
    [0.0, 0.14],
    [0.61, 0.0],
    [0.14, 0.07],
    [0.14, 0.41],
    [0.07, 0.0],
    [0.41, 0.14]
])

# матрица вероятностей покупки при клике
P_buy_click = np.array([
    [0.14, 0.07],
    [0.14, 0.41],
    [0.07, 0.0],
    [0.41, 0.14],
    [0.07, 0.41],
    [0.0, 0.14],
    [0.61, 0.0],
    [0.14, 0.07],
    [0.14, 0.41],
    [0.07, 0.0],
    [0.07, 0.41],
    [0.0, 0.14],
    [0.14, 0.61],
    [0.41, 0.14],  
    [0.14, 0.61],
    [0.07, 0.41],
    [0.0, 0.14],
    [0.61, 0.0],
    [0.07, 0.41],
    [0.0, 0.14]
])

P_buy = P_click * P_buy_click
print(P_buy)
