'''
### s0-s3 выжил, s0B-s3B купил ушел, s0D-s3D None ушел

s0, s0B, s0D ход предыдущий L -> вниз 
s1, s1B, s1D ход предудущий R -> влево, вниз 
s2, s2B, s2D ход предыдущий R -> вниз 
s3, s3B, s3D ход предыдущий L -> вправо, вниз


S0 -> S0, S3
S1 -> S0, S3
S2 -> S1, S2
S3 -> S1, S2
'''


import numpy as np

# Состояния
states = np.array(["S0", "S1", "S2", "S3", "S0B", "S1B", "S2B", "S3B", "S0D", "S1D", "S2D", "S3D",  "None"])

# Матрица переходов P (строка — откуда, столбец — куда)
alpha = 1
n = 6
L = alpha / n
P = np.array([
    [L, 0.0, 0.0, L, L, 0.0, 0.0, L, L, 0.0, 0.0, L, 0.0],
    [L, 0.0, 0.0, L, L, 0.0, 0.0, L, L, 0.0, 0.0, L, 0.0],
    [0.0, L, L, 0.0, 0.0, L, L, 0.0, 0.0, L, L, 0.0, 0.0],
    [0.0, L, L, 0.0, 0.0, L, L, 0.0, 0.0, L, L, 0.0, 0.0],
    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0], 
    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0], 
    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0], 
    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0], 
    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0], 
    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0], 
    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0], 
    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0], 
    [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0], 
])

# Начальное распределение: на 100% в сумме у трех состояний где он выжил
pi = np.array([0.25, 0.25, 0.25, 0.25, 0, 0, 0, 0, 0, 0, 0, 0, 0]) 

# print("Шаг 0:", pi, "=>", dict(zip(states, pi)))
print("Шаг 0:", pi, np.sum(pi))

# Делаем 10 шагов: pi_{t+1} = pi_t * P
for t in range(1, 20):
    pi = pi @ P      # умножение вектора-строки на матрицу переходов
#   print(f"Шаг {t}:", pi,'\n',  "=>", dict(zip(states, pi)))
    print(f"Шаг {t}:", pi, np.sum(pi))   
