# Матрица вероятностей перехода между состояниями по цветам
P_look = [
    [0.6, 0.2, 0.2],
    [0.2, 0.6, 0.2],
    [0.2, 0.2, 0.6],
]

# P_click = P_rel(i)
# P_buy_click = Prel(i) # Вероятность покупки при клике
# P_break = 0.15


P_break = 0.15
P_rel_n = {0.0, 0.07, 0.14, 0.41, 0.61} # Все возможные значения p_rel

# Матрица вероятностей покупки для каждого элемента выдачи
P_rel = [
    [0.07, 0.41],
    [0.0, 0.14],
    [0.14, 0.61],
    [0.07, 0.41],
    [0.0, 0.14],
    [0.61, 0.0],
    [0.14, 0.07],
    [0.14, 0.41],
    [0.07, 0.0],
    [0.41, 0.14],
    [0.07, 0.41],
    [0.0, 0.14],
    [0.14, 0.61],
    [0.07, 0.41],
    [0.0, 0.14],
    [0.61, 0.0],
    [0.14, 0.07],
    [0.14, 0.41],
    [0.07, 0.0],
    [0.41, 0.14]
]